Обработки/Reports/_ОтчетОПервичныхДокументах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОПервичныхДокументах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОПервичныхДокументах/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
КонецПроцедуры

&НаКлиенте
Процедура СДУИВидыДДУПриИзменении(Элемент)
	
	Отчет.СчетаДоверительногоУправления.Очистить();
	Отчет.ВидыДоговоровДоверительногоУправления.Очистить();
	
	Для Каждого ТекЭлемент Из СДУИВидыДДУ Цикл
		Если ТипЗнч(ТекЭлемент.Значение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
			Отчет.СчетаДоверительногоУправления.Добавить(ТекЭлемент.Значение);
		ИначеЕсли ТипЗнч(ТекЭлемент.Значение) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
			Отчет.ВидыДоговоровДоверительногоУправления.Добавить(ТекЭлемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
